app/Http/Controllers/DashboardController.php

    private function superAdminDashboard()
    {
        $stats = [
            'companies' => Company::count(),
            'users' => User::whereNotNull('company_id')->count(),
            'urls' => ShortUrl::count(),
            'clicks' => ShortUrl::sum('clicks'),
        ];


        // $allUrls = ShortUrl::with(['user', 'company'])->latest() ->paginate(2);
        $allUrls = ShortUrl::with(['user', 'company'])->latest() ->paginate(config('app.PAGINATION_NUMBER'));
---
select count(*) as aggregate from `companies` where `companies`.`deleted_at` is null
select count(*) as aggregate from `users` where `company_id` is not null
select count(*) as aggregate from `short_urls` where `short_urls`.`deleted_at` is null
select sum(`clicks`) as aggregate from `short_urls` where `short_urls`.`deleted_at` is null
select * from `companies` where `companies`.`id` in (5) and `companies`.`deleted_at` is null
select * from `short_urls` where `short_urls`.`deleted_at` is null order by `created_at` desc limit 2 offset 0
select * from `users` where `users`.`id` in (5, 6)