app/Http/Controllers/InvitationController.php

    public function index()
    {
        $user = Auth::user();

        if ($user->isSuperAdmin()) {
            $invitations = User::with(['company', 'invitedBy'])->whereNotNull('invited_by')->latest('invited_at')->paginate(config('app.PAGINATION_NUMBER'));
---
select * from `companies` where `companies`.`id` in (5) and `companies`.`deleted_at` is null
select * from `users` where `invited_by` is not null order by `invited_at` desc limit 2 offset 2
select count(*) as aggregate from `users` where `invited_by` is not null